hans-jorg/stm32f746g/24-LCD/lcd.c
/**
 * @file    lcd.c
 *
 * @date    07/10/2020
 * @author  Hans
 */

#include "stm32f746xx.h"
#include "system_stm32f746.h"
#include "lcd.h"


#define BIT(N)          (1U<<(N))

/**
 * @brief Use GPIO library to initialize and control pins
 *
 * @note  Comment it to use a faster but larger implementation
 */
#define LCD_USEGPIO 1

/**
 *  @brief  Default values
 */
///@{
#define BACKGROUND_COLOR        RGB(0,0,255)


///@}

/*
 * @brief   LCD Connection
 *
 * LCD signal   | Board signal      | MCU signal             |
 *--------------|-------------------|------------------------|
 *  CLK         | LCD_CLK           | PI14                   |
 *  LCD_R       | LCD_R0-7          | PI15 PJ0-6             |
 *  LCD_G       | LCD_G0-7          | PJ7-11 PK0-2           |
 *  LCD_B       | LCD_B0-7          | PE4 PJ13-15 PG12 PK4-6 |
 *  HSYNC       | LCD_HSYNC         | PI10                   |
 *  VSYNC       | LCD_VSYNC         | PI9                    |
 *  DE          | LCD_DE            | PK7                    |
 *  SCL         | LCD_SCL           | PH7                    |
 *  SDA         | LCD_SDA           | PH8                    |
 *  RST         | LCD_RST/NRST      | NRST                   |
 *  INT         | LCD_INT           | PI13                   |
 *  DISP        | LCD_DISP          | PI12                   |
 *  Backlight   | LCD_BL_CTRL       | PK3                    |
 *
 * @note I2CX signals (LCD_SCL and LCD_SDA) are shared with an audio device
 *
 * @note LCD_BL_CTRL, LCD_DISP, LCD_INT, LCD_RST are not controlled by the LCD
 *       interface
 */

/*
 * @brief   Mask for LCD signals
 *
 * @note    LCD_BACKLIGHTCTRL  controls the enable pin of the STLD40DPUR (hite LED power
 *          supply for large display backlight)
 *
 * @note    LCD_DISP controls normal operation (1) or stand-by (0)
 *
 * @note    LCD_INT interrupts the MCU
 *
 */
/** On port K */
///@{
#define LCD_BACKLIGHTCTRL_MASK  BIT(3)
///@}
/** On port I */
///@{
#define LCD_INTERRUPT_MASK      BIT(13)
#define LCD_NORMALSTANDBY_MASK  BIT(12)
///@}

/**
 *  @brief  Characteristics of the LCD interface
 *
 * | Signal  | Description                 |  Min     |  Max     |
 * |---------|-----------------------------|----------|----------|
 * | LCD_CLK | LTDC clock output frequency |  -       |  45 MHz  |
 *
 *  @note LCD_CLK is generated from the R output of the PLLSAI
 *
 *  @note There is a divisor (LLSAIDIVR) of the R output signal that can assume the
 *        values 2, 4, 8 and 16. Is is set in the field PLLSAIDIVR of the RCC_DCKFGR1 register.
 *  @note The input of the PLLSAI is the same of Main PLL. In this project
 *        it is 1 MHz, obtained by dividing the 25 MHz clock input by M=25, set in the
 *        field PLLM of the RCC_PLLCFGR register.
 */

/**
 * @brief   Point to base address of LTDC Layer registers
 *
 * @note    Extra Layer2 at 0 to make possible to use integer 1 and 2 to represent
 *          the layer. An extra benefit is that 0 can be used as an index too.
 */
static LTDC_Layer_TypeDef *LTDC_Layer[3] = {LTDC_Layer2, LTDC_Layer1, LTDC_Layer2};
/**
 * @brief   Characteristics of the LCD display
 *
 * @note    Device Caracteristics from Rocktech RK043FN48H-CT672B Datasheet
 *
 *     Item               |  Min  |  Typ  |  Max  |  Units
 *   ---------------------|-------|-------|-------|--------------------
 *   DCLK Frequency       |    5  |    9  |   12  |  MHz
 *   DCLK Period          |   83  |  119  |  200  |  ns
 *   HSYNC Period         |  490  |  531  |  605  | DCLK Period
 *   HSYNC Display        |       |  480  |       | DCLK Period
 *   HSYNC Back porch     |    8  |   43  |       | DCLK Period
 *   HSYNC Front porch    |    2  |    1  |       | DCLK Period
 *   HSYNC pulse width    |    1  |       |       | DCLK Period
 *   VSYNC Period         |  275  |  288  |  335  | HSYNC Period
 *   VSYNC Display Period |       |  272  |       | HSYNC Period
 *   VSYNC Back porch     |    2  |   12  |       | HSYNC Period
 *   VSYNC Front porch    |    1  |    4  |       | HSYNC Period
 *   VSYNC pulse width    |    1  |   10  |       | HSYNC Period
 */

/**
 * @brief   Struct to store information about display
 */
typedef struct {
    uint32_t    frequency;          /// LCD frequency
    uint32_t    polarity;           /// polarity of control signals (Use LTDC_CGR_xxPOL symbols)
    uint16_t    divider;            /// divider to be used ??
    uint16_t    width;              /// Visible width
    uint16_t    height;             /// Visible height
    uint16_t    hsync;              /// Horizontal synchronization
    uint16_t    vsync;              /// Vertical synchronization (unit is HSYNC Period)
    uint16_t    hfp;                /// Horizontal front porch (unit is LCD_CLK Period)
    uint16_t    hbp;                /// Horizontal back porch  (unit is LCD_CLK Period)
    uint16_t    vfp;                /// Vertical front porch (unit is HSYNC Period)
    uint16_t    vbp;                /// Vertical back porch (unit is HSYNC Period)
    uint16_t    pitch[5];           /// Pitch used to store lines in memory (in bytes)
                                    /// For 1,2,3,4 bytes (Position 0 not used)

} DisplayProperties_t;

/**
  * @brief  RK043FN48H properties
  */

const DisplayProperties_t dispRK043 = {
    .frequency  =   9000000,        // range [5..12] MHz
    .polarity   =   0,              // Use LTDC_CGR_xxPOL symbols)
    .divider    =   5,              //
    .width      =   480,            //
    .height     =   272,            //
    .hsync      =   41,             //
    .vsync      =   10,             //
    .hfp        =   32,             // or 8
    .hbp        =   13,             // or 40
    .vfp        =   2,              // or 4
    .vbp        =   2,              // or 12
    .pitch      = { 0,              // Position not used!!!!
                    512,            // L8 and other 1 byte representation
                    1024,           // RGB565 and other 2 bytes representation
                    1536,           // RGB888 (3 bytes)
                    2048 },         // for ARGB8888 (4 bytes)
};

/**
 * @brief Pointer to current display
 *
 * @note  For now, only one
 */
const DisplayProperties_t *display = &dispRK043;

/**
 * @brief Symbols to make it easier to write complex expressions
 */
///@{
#define LCD_FREQ    (display->frequency)
#define HSW         (2)
#define HAW         (display->width)
#define HFP         (display->hfp)
#define HBP         (display->hbp)
#define VSW         (2)
#define VAH         (display->height)
#define VBP         (display->vbp)
#define VFP         (display->vfp)
#define POL         (display->polarity)
///@}

static const int pixelsize[] = {
        4,  // 000: ARGB8888
        3,  // 001: RGB888
        2,  // 010: RGB565
        2,  // 011: ARGB1555
        2,  // 100: ARGB4444
        1,  // 101: L8 (8-bit luminance)
        1,  // 110: AL44 (4-bit alpha, 4-bit luminance)
        1   // 111: AL88 (8-bit alpha, 8-bit luminance)
};

/**
 *  @brief Pin Configuration for LCD
 *
 * Alternate Functions.(Table 12 of datasheet)
 *
 * LCD Signal   | ALT     |  Pin
 * -------------|---------|--------------------
 * LCD_CLK      |  AF14   | *PI14* PE14 PG7
 *
 * LCD_R0       |  AF14   | PG13 PH2 *PI15*
 * LCD_R1       |  AF14   | PA2 PH3 *PJ0*
 * LCD_R2       |  AF14   | PA1 PC10 PH8 *PJ1*
 * LCD_R3       |  AF14   | PH9 *PJ2* PB0 (AF9)
 * LCD_R4       |  AF14   | PA5 PA11 PH10 *PJ3*
 * LCD_R5       |  AF14   | PA12 PC0 PH11 *PJ4*
 * LCD_R6       |  AF14   | PA8 PH12 *PJ5* PB1(AF9)
 * LCD_R7       |  AF14   | PE15 PG6 *PJ6*
 *
 * LCD_G0       |  AF14   | PE5 *PJ7*
 * LCD_G1       |  AF14   | PE6 *PJ8*
 * LCD_G2       |  AF14   | PA6 PH13 *PJ9*
 * LCD_G3       |  AF14   | PE11 PH14 *PJ10* PG10(AF9)
 * LCD_G4       |  AF14   | PB10 PH15 *PJ11*
 * LCD_G5       |  AF14   | PB11 PI0 *PK0*
 * LCD_G6       |  AF14   | PC7 PI1 *PK1*
 * LCD_G7       |  AF14   | PD3 PI2 *PK2*
 * -            |   -     | ---
 * LCD_B0       |  AF14   | *PE4* PG14 PJ12
 * LCD_B1       |  AF14   | PG12 *PJ13*
 * LCD_B2       |  AF14   | PD6 PG10 *PJ14*
 * LCD_B3       |  AF14   | PD10 PG11 *PJ15*
 * LCD_B4       |  AF14   | PE12 PG12 *PG12(AF9)* PI4 PK3
 * LCD_B5       |  AF14   | PA3 PI5 *PK4*
 * LCD_B6       |  AF14   | PB8 PI6 *PK5*
 * LCD_B7       |  AF14   | PB9 PI7 *PK6*
 * -            |   -     | ---
 * LCD_VSYNC    |  AF14   | PA4 *PI9* PI13
 * LCD_HSYNC    |  AF14   | PC6 *PI10* PI12
 * LCD_DE       |  AF14   | PE13 PF10 *PK7*
 *
 * The following uses GPIO I/O or other modes
 *
 * LCD Signal    |        |  Pin   |  Description
 * --------------|--------|--------|------------------
 *  LCD_DISP     | GPIO   | I12    |  Enable LCD
 *  LCD_INT      | GPIO   | I13    |  LCD Interrupt
 *  LCD_BL_CTRL  | GPIO   | K3     |  Backlight PWM
 */

#ifdef LCD_USEGPIO

#include "gpio.h"
/* Pin Configuration Fields                                                    */
/* GPIOx: GPIO interface        [GPIOA...GPIOK]                                */
/*     AF: Alternate function   [0:GPIO,2:I2C, ... 14:LCD]                     */
/*     M:  Mode                 [0:Input, 1=Output,2=AF,3=Analog]              */
/*     OT: Output Type          [0:Push-pull, 1=Open-drain ]                   */
/*     S:  Speed                [0:Low, 1:Medium, 2:High, 3:Very high]         */
/*     P:  Pull-down/Pull-up    [0:None, 1:Pull-up, 2:Pull-down]               */
/*     I:  Initial              [0: Low, 1:High]                               */
static const GPIO_PinConfiguration configtable[] = {

/*    GPIOx    Pin     AF  M  O  S  P  I  */
// Control
    { GPIOI,    14,    14, 2, 0, 3, 0, 0 },       // LCD_CLK
    { GPIOI,     9,    14, 2, 0, 3, 0, 0 },       // LCD_VSYNC
    { GPIOI,    10,    14, 2, 0, 3, 0, 0 },       // LCD_HSYNC
    { GPIOK,     7,    14, 2, 0, 3, 0, 0 },       // LCD_DE
// Red
    { GPIOI,    15,    14, 2, 0, 3, 0, 0 },       // LCD_R0
    { GPIOJ,     0,    14, 2, 0, 3, 0, 0 },       // LCD_R1
    { GPIOJ,     1,    14, 2, 0, 3, 0, 0 },       // LCD_R2
    { GPIOJ,     2,    14, 2, 0, 3, 0, 0 },       // LCD_R3
    { GPIOJ,     3,    14, 2, 0, 3, 0, 0 },       // LCD_R4
    { GPIOJ,     4,    14, 2, 0, 3, 0, 0 },       // LCD_R5
    { GPIOJ,     5,    14, 2, 0, 3, 0, 0 },       // LCD_R6
    { GPIOJ,     6,    14, 2, 0, 3, 0, 0 },       // LCD_R7
// Green
    { GPIOJ,     7,    14, 2, 0, 3, 0, 0 },       // LCD_G0
    { GPIOJ,     8,    14, 2, 0, 3, 0, 0 },       // LCD_G1
    { GPIOJ,     9,    14, 2, 0, 3, 0, 0 },       // LCD_G2
    { GPIOJ,    10,    14, 2, 0, 3, 0, 0 },       // LCD_G3
    { GPIOJ,    11,    14, 2, 0, 3, 0, 0 },       // LCD_G4
    { GPIOK,     0,    14, 2, 0, 3, 0, 0 },       // LCD_G5
    { GPIOK,     1,    14, 2, 0, 3, 0, 0 },       // LCD_G6
    { GPIOK,     2,    14, 2, 0, 3, 0, 0 },       // LCD_G7
// Blue
    { GPIOE,     4,    14, 2, 0, 3, 0, 0 },       // LCD_B0
    { GPIOJ,    13,    14, 2, 0, 3, 0, 0 },       // LCD_B1
    { GPIOJ,    14,    14, 2, 0, 3, 0, 0 },       // LCD_B2
    { GPIOJ,    15,    14, 2, 0, 3, 0, 0 },       // LCD_B3
    { GPIOG,    12,    14, 2, 0, 3, 0, 0 },       // LCD_B4
    { GPIOK,     4,    14, 2, 0, 3, 0, 0 },       // LCD_B5
    { GPIOK,     5,    14, 2, 0, 3, 0, 0 },       // LCD_B6
    { GPIOK,     6,    14, 2, 0, 3, 0, 0 },       // LCD_B7

// I2C
    { GPIOH,     7,     4, 0, 2, 3, 0, 0 },       // LCD_SCL / AUDIO SCL (I2C3_SDA)
    { GPIOH,     8,     4, 0, 2, 3, 0, 0 },       // LCD_SDA / AUDIO SDA (I2C3_SCL)
// Others
    { GPIOI,    13,     0, 0, 1, 0, 0, 0 },       // LCD INT = input
    { GPIOI,    12,     0, 1, 0, 3, 0, 0 },       // LCD DISP = output
    { GPIOK,     3,     0, 1, 0, 2, 0 ,0 },       // LCD Backlight Control = output
    {     0,     0,     0, 0, 0, 0, 0 ,0 },       // End of table indicator
};


static void ConfigureLCDPins(void) {

    /* Configure pins from table*/
    GPIO_ConfigureMultiplePins(configtable);

