hans-jorg/stm32f746g/24-LCD/lcd.c
}
#else

static void ConfigureLCDPins(void) {
uint32_t mFIELD, mVALUE;

    /********* Configuring LCD signals *******************/

    /*
     * Port   GPIOE
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    __NOP(); __DSB();
                // Configuring Mode

    mFIELD =    GPIO_MODER_MODER4_Msk;
    mVALUE =   (2<<GPIO_MODER_MODER4_Pos);
    GPIOE->MODER  = (GPIOE->MODER&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 7-0)
    mFIELD =    GPIO_AFRL_AFRL4_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL4_Pos);
    GPIOE->AFR[0]  = (GPIOE->AFR[0]&~mFIELD)|mVALUE;

    /*
     * Port   GPIOG
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
    __NOP(); __DSB();
                // Configuring Mode
    mFIELD =    GPIO_MODER_MODER12_Msk;
    mVALUE =   (2<<GPIO_MODER_MODER12_Pos);
    GPIOG->MODER  = (GPIOG->MODER&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 15-8)
    mFIELD =    GPIO_AFRL_AFRL4_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL4_Pos);  /////////
    GPIOG->AFR[1]  = (GPIOG->AFR[1]&~mFIELD)|mVALUE;

    /*
     * Port   GPIOI
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
    __NOP(); __DSB();
                // Configuring Mode
    mFIELD =   GPIO_MODER_MODER9_Msk
              |GPIO_MODER_MODER10_Msk
              |GPIO_MODER_MODER12_Msk
              |GPIO_MODER_MODER13_Msk
              |GPIO_MODER_MODER14_Msk
              |GPIO_MODER_MODER15_Msk;
    mVALUE =   (2<<GPIO_MODER_MODER9_Pos)
              |(2<<GPIO_MODER_MODER10_Pos)
              |(2<<GPIO_MODER_MODER12_Pos)
              |(2<<GPIO_MODER_MODER13_Pos)
              |(2<<GPIO_MODER_MODER14_Pos)
              |(2<<GPIO_MODER_MODER15_Pos);
    GPIOI->MODER  = (GPIOI->MODER&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 15-8)
    mFIELD =   GPIO_AFRL_AFRL1_Msk
              |GPIO_AFRL_AFRL2_Msk
              |GPIO_AFRL_AFRL4_Msk
              |GPIO_AFRL_AFRL5_Msk
              |GPIO_AFRL_AFRL6_Msk
              |GPIO_AFRL_AFRL7_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL1_Pos)
              |(14<<GPIO_AFRL_AFRL2_Pos)
              |(14<<GPIO_AFRL_AFRL4_Pos)
              |(14<<GPIO_AFRL_AFRL5_Pos)
              |(14<<GPIO_AFRL_AFRL6_Pos)
              |(14<<GPIO_AFRL_AFRL7_Pos);
    GPIOI->AFR[1]  = (GPIOI->AFR[1]&~mFIELD)|mVALUE;

    /*
     * Port   GPIOJ
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOJEN;
    __NOP(); __DSB();
                // Configuring Mode
    mFIELD =   GPIO_MODER_MODER0_Msk
              |GPIO_MODER_MODER1_Msk
              |GPIO_MODER_MODER2_Msk
              |GPIO_MODER_MODER3_Msk
              |GPIO_MODER_MODER4_Msk
              |GPIO_MODER_MODER5_Msk
              |GPIO_MODER_MODER6_Msk
              |GPIO_MODER_MODER7_Msk;

    mVALUE =   (2<<GPIO_MODER_MODER0_Pos)
              |(2<<GPIO_MODER_MODER1_Pos)
              |(2<<GPIO_MODER_MODER2_Pos)
              |(2<<GPIO_MODER_MODER3_Pos)
              |(2<<GPIO_MODER_MODER4_Pos)
              |(2<<GPIO_MODER_MODER5_Pos)
              |(2<<GPIO_MODER_MODER6_Pos)
              |(2<<GPIO_MODER_MODER7_Pos)
              |(2<<GPIO_MODER_MODER8_Pos)
              |(2<<GPIO_MODER_MODER9_Pos)
              |(2<<GPIO_MODER_MODER10_Pos)
              |(2<<GPIO_MODER_MODER11_Pos)
              |(2<<GPIO_MODER_MODER13_Pos)
              |(2<<GPIO_MODER_MODER14_Pos)
              |(2<<GPIO_MODER_MODER15_Pos);
    GPIOJ->MODER  = (GPIOJ->MODER&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 7-0)
    mFIELD =   GPIO_AFRL_AFRL0_Msk
              |GPIO_AFRL_AFRL1_Msk
              |GPIO_AFRL_AFRL2_Msk
              |GPIO_AFRL_AFRL3_Msk
              |GPIO_AFRL_AFRL4_Msk
              |GPIO_AFRL_AFRL5_Msk
              |GPIO_AFRL_AFRL6_Msk
              |GPIO_AFRL_AFRL7_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL0_Pos)
              |(14<<GPIO_AFRL_AFRL1_Pos)
              |(14<<GPIO_AFRL_AFRL2_Pos)
              |(14<<GPIO_AFRL_AFRL3_Pos)
              |(14<<GPIO_AFRL_AFRL4_Pos)
              |(14<<GPIO_AFRL_AFRL5_Pos)
              |(14<<GPIO_AFRL_AFRL6_Pos)
              |(14<<GPIO_AFRL_AFRL7_Pos);
    GPIOJ->AFR[0]  = (GPIOJ->AFR[0]&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 15-8)
    mFIELD =   GPIO_AFRL_AFRL0_Msk
              |GPIO_AFRL_AFRL1_Msk
              |GPIO_AFRL_AFRL2_Msk
              |GPIO_AFRL_AFRL3_Msk
              |GPIO_AFRL_AFRL5_Msk
              |GPIO_AFRL_AFRL6_Msk
              |GPIO_AFRL_AFRL7_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL0_Pos)
              |(14<<GPIO_AFRL_AFRL1_Pos)
              |(14<<GPIO_AFRL_AFRL2_Pos)
              |(14<<GPIO_AFRL_AFRL3_Pos)
              |(14<<GPIO_AFRL_AFRL5_Pos)
              |(14<<GPIO_AFRL_AFRL6_Pos)
              |(14<<GPIO_AFRL_AFRL7_Pos);
    GPIOJ->AFR[1]  = (GPIOJ->AFR[1]&~mFIELD)|mVALUE;



    /*
     * Port   GPIOK
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
    __NOP(); __DSB();
                // Configuring Mode
    mFIELD =   GPIO_MODER_MODER0_Msk
              |GPIO_MODER_MODER1_Msk
              |GPIO_MODER_MODER2_Msk
              |GPIO_MODER_MODER4_Msk
              |GPIO_MODER_MODER5_Msk
              |GPIO_MODER_MODER6_Msk
              |GPIO_MODER_MODER7_Msk;
    mVALUE =   (2<<GPIO_MODER_MODER0_Pos)
              |(2<<GPIO_MODER_MODER1_Pos)
              |(2<<GPIO_MODER_MODER2_Pos)
              |(2<<GPIO_MODER_MODER4_Pos)
              |(2<<GPIO_MODER_MODER5_Pos)
              |(2<<GPIO_MODER_MODER6_Pos)
              |(2<<GPIO_MODER_MODER7_Pos);
    GPIOK->MODER  = (GPIOK->MODER&~mFIELD)|mVALUE;

                // Configuring Alternate Function (Pins 7-0)
    mFIELD =   GPIO_AFRL_AFRL0_Msk
              |GPIO_AFRL_AFRL1_Msk
              |GPIO_AFRL_AFRL2_Msk
              |GPIO_AFRL_AFRL4_Msk
              |GPIO_AFRL_AFRL5_Msk
              |GPIO_AFRL_AFRL6_Msk
              |GPIO_AFRL_AFRL7_Msk;
    mVALUE =   (14<<GPIO_AFRL_AFRL0_Pos)
              |(14<<GPIO_AFRL_AFRL1_Pos)
              |(14<<GPIO_AFRL_AFRL2_Pos)
              |(14<<GPIO_AFRL_AFRL4_Pos)
              |(14<<GPIO_AFRL_AFRL5_Pos)
              |(14<<GPIO_AFRL_AFRL6_Pos)
              |(14<<GPIO_AFRL_AFRL7_Pos);
    GPIOK->AFR[0]  = (GPIOK->AFR[0]&~mFIELD)|mVALUE;

