hans-jorg/stm32f746g/24-LCD/lcd.c
    /*
     * I2C signals
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
    __NOP(); __DSB();
                // Configuring Mode
    mFIELD =   GPIO_MODER_MODER7_Msk
              |GPIO_MODER_MODER8_Msk;
    mVALUE =   (2<<GPIO_MODER_MODER7_Pos)
              |(2<<GPIO_MODER_MODER8_Pos);
    GPIOH->MODER  = (GPIOH->MODER&~mFIELD)|mVALUE;
                // Configuring Alternate Function (Pins 7-0)
    mFIELD =   GPIO_AFRL_AFRL7_Msk;
    mVALUE =   (4<<GPIO_AFRL_AFRL7_Pos);
    GPIOH->AFR[0]  = (GPIOH->AFR[0]&~mFIELD)|mVALUE;
                // Configuring Alternate Function (Pins 15-8)
    mFIELD =   GPIO_AFRL_AFRL0_Msk;
    mVALUE =   (4<<GPIO_AFRL_AFRL0_Pos);
    GPIOH->AFR[1]  = (GPIOH->AFR[1]&~mFIELD)|mVALUE;
    /*
     * LCD Control signals using GPIO
     *
     *     LCD_INT      PI13    input   LCD interrupt signal
     *     LCD_DISP     PI12    output
     *     LCD_BL_CTRL  PK3     output
     */
                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
    __NOP(); __DSB();
                // Configuring mode
    mFIELD =   GPIO_MODER_MODER12_Msk
              |GPIO_MODER_MODER13_Msk;
    mVALUE =   (1<<GPIO_MODER_MODER12_Pos)
              |(0<<GPIO_MODER_MODER13_Pos);
    GPIOI->MODER  = (GPIOI->MODER&~mFIELD)|mVALUE;

                // Enabling clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
    __NOP(); __DSB();
                // Configuring mode
    mFIELD =   GPIO_MODER_MODER3_Msk;
    mVALUE =   (1<<GPIO_MODER_MODER3_Pos);
    GPIOK->MODER  = (GPIOK->MODER&~mFIELD)|mVALUE;

}
#endif

/**
 * @brief   Turn LCD Backlight On/Off
 *
 * @note    GPIOK Pin 3 controls the backlight
 */

///@{
void  LCD_TurnBacklightOn(void) {

#ifdef LCD_USEGPIO
    GPIO_Init(GPIOK,0,LCD_BACKLIGHTCTRL_MASK);
    GPIO_Set(GPIOK,LCD_BACKLIGHTCTRL_MASK);
#else
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
    __NOP(); __DSB();
    GPIOK->MODER  = (GPIOK->MODER&~GPIO_MODER_MODER3_Msk)
                    |(1<<GPIO_MODER_MODER3_Pos);
    GPIOK->BSRR |= LCD_BACKLIGHTCTRL_MASK;
#endif

}

void  LCD_TurnBacklightOff(void) {

#ifdef LCD_USEGPIO
    GPIO_Init(GPIOK,0,LCD_BACKLIGHTCTRL_MASK);
    GPIO_Clear(GPIOK,LCD_BACKLIGHTCTRL_MASK);
#else
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
    __NOP(); __DSB();
    GPIOK->MODER  = (GPIOK->MODER&~GPIO_MODER_MODER3_Msk)
                    |(1<<GPIO_MODER_MODER3_Pos);
    GPIOK->BSRR |= (LCD_BACKLIGHTCTRL_MASK<<16);
#endif

}
///@}

/**
 * @brief   Turn LCD Backlight On/Off
 *
 * @note    GPIOK Pin 3 controls the backlight
 */

///@{
void  LCD_PutDisplayOperation(void) {

#ifdef LCD_USEGPIO
    GPIO_Set(GPIOI,LCD_NORMALSTANDBY_MASK);
#else
    GPIOI->BSRR |= LCD_NORMALSTANDBY_MASK;
#endif

}

void  LCD_LCD_PutDisplayStandBy(void) {

#ifdef LCD_USEGPIO
    GPIO_Clear(GPIOI,LCD_NORMALSTANDBY_MASK);
#else
    GPIOI->BSRR |= (LCD_NORMALSTANDBY_MASK<<16);
#endif

}
///@}



/**
 * @brief   Enable/Disable LCD Controler
 *
 * @note    GPIOK Pin 3 controls the backlight
 */

///@{
void  LCD_EnableController(void) {

    LTDC->GCR |= LTDC_GCR_LTDCEN;

}

void  LCD_DisableController(void) {

    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

}
///@}


/**
 * @brief   Turn LCD Backlight On/Off
 *
 * @note    GPIOK Pin 3 controls the backlight
 */

///@{
void  LCD_On(void) {

    LCD_EnableController();
    LCD_PutDisplayOperation();
    LCD_TurnBacklightOn();

}

void  LCD_Off(void) {

    LCD_DisableController();
    LCD_LCD_PutDisplayStandBy();
    LCD_TurnBacklightOff();
}
///@}


/*
 * @brief   Configuration for PLLSAI
 *
 * @note    Assumes PLL Main will use HSE (crystal) and have a 1 MHz input for PLL
 *
 * @note    $$ f_{VCOOUT} = f_{INPUT} * N / M $$
 *          $$ f_{OUTP} = {VCOOUT} / P $$
 *          $$ f_{OUTQ} = {VCOOUT} / Q $$
 *          $$ f_{OUTR} = {VCOOUT} / R $$
 *
 *          $$ f_{INPUT} = "16 MHz (HSI)" or "25 MHz (HSE)" $$
 *          $$ M = {2..63} identical to the one used in Main PLL
 *          $$ N = {50..432 } $$
 *          $$ P = {2, 4, 6, 8 } $$
 *          $$ Q = {2..15 } $$
 *          $$ R = {2..7} $$


 * @note    LCD_CLK should be in range 5-12, with typical value 9 MHz.
 *
 * @note    There is an extra divisor in PLLSAIDIVR[1:0] of RCC_DCKCFGR, that can
 *          have value 2, 4, 8 or 16.
 *
 * @note    So the R output must be 18, 36, 72 or 144 MHz.
 *          But USB, RNG and SDMMC needs 48 MHz. The LCM of 48 and 9 is 144.
 *          But there are a minimal value for the divisor equal to 2.
 *          $$ f_{OUTR} = 72 $$
 *
 * @note    For f_LCDCLK  = 9 MHz the extra divisor PLLSAIRDIV must be 8
 *
 */

/**
 * @brief   Flag to indicate clock for the LCD is set
 */
static int  LCDCLOCK_Initialized = 0;

/**
 * @brief   Set Clock for LCD
 *
 * @note    LCD_CLOCK for the display used must be in the range [5..12]
 */
int LCD_SetClock(void) {
uint32_t pllsaidivr;
int div;
PLLOutputFrequencies_t pllfreq;


    if( ! (RCC->CR&RCC_CR_PLLSAION) ) {
        SystemConfigPLLSAI(&PLLSAIConfiguration_48MHz);
        SystemEnablePLLSAI();
    }

    SystemGetPLLFrequencies(PLL_SAI, &pllfreq);
    div = pllfreq.routfreq/LCD_FREQ;


    switch(div) {
    case 2:  pllsaidivr = 0; break;
    case 4:  pllsaidivr = 1; break;
    case 8:  pllsaidivr = 2; break;
    case 16: pllsaidivr = 3; break;
    default:
        return -2; // ignore wrong divisor
    }

    // Configure divisor for LCD controller
    RCC->DCKCFGR1 = (RCC->DCKCFGR1&~RCC_DCKCFGR1_PLLSAIDIVR)
                    |(pllsaidivr<<RCC_DCKCFGR1_PLLSAIDIVR_Pos);

    // Enable clock for LCD controller
    RCC->APB2ENR |= RCC_APB2ENR_LTDCEN;

    LCDCLOCK_Initialized = 1;
    return 0;
}


/**
 * @brief   LCD Low Level Initializationb
 *
 * @note    Configure LCD unit
 *
 * @note    *PLLSAI must be configured and ON before calling this routine*
 *
 * @note    The R output of PLLSAI generates pixel clock (LCD_CLK)
 */

void LCD_Init(void) {

    /* If LCD Clock not initialized */
    if( !LCDCLOCK_Initialized )
        LCD_SetClock();

    /* If PLLSAI not on, return */
    if( (RCC->CR & RCC_CR_PLLSAION) == 0 )
        return;

