hans-jorg/stm32f746g/24-LCD/lcd.c
    /* If PLLSAI not ready, return */
    if( (RCC->CR & RCC_CR_PLLSAIRDY) == 0 )
        return;

    /* Configure pins for LCD usage */
    ConfigureLCDPins();

    // Enable clock for LCD
    RCC->APB2ENR |= RCC_APB2ENR_LTDCEN;

    // Reset LCD

    // configure polarity of control signals
    LTDC->GCR =   (LTDC->GCR&~(LTDC_GCR_DEPOL|LTDC_GCR_HSPOL|LTDC_GCR_VSPOL|LTDC_GCR_PCPOL))
                 |(POL);
    // Configure LCD geometry
    LTDC->SSCR =  (HSW-1)<<LTDC_SSCR_HSW_Pos
                 |(VSW-1)<<LTDC_SSCR_VSH_Pos;
    LTDC->BPCR =  (HSW+HBP-1)<<LTDC_BPCR_AHBP_Pos
                 |(VSW+VBP-1)<<LTDC_BPCR_AVBP_Pos;
    LTDC->AWCR =  (HSW+HBP+HAW-1)<<LTDC_AWCR_AAW_Pos
                 |(VSW+VBP+VAH-1)<<LTDC_AWCR_AAH_Pos;
    LTDC->TWCR  = (HSW+HBP+HAW+HFP-1)<<LTDC_TWCR_TOTALW_Pos
                 |(VSW+VBP+VAH+VFP-1)<<LTDC_TWCR_TOTALH_Pos;

    // Set background color
    LTDC->BCCR = BACKGROUND_COLOR;

    /* Enable interrupts */
    //LTDC->IER  |= (LTDC_IER_RRIE|LTDC_IER_TERRIE|LTDC_IER_FUIE|LTDC_IER_LIE);


    LCD_PutDisplayOperation();
    LCD_TurnBacklightOn();

}


/*
 * @brief   LCD Set Background Color
 */

void
LCD_SetBackgroundColor( uint32_t bgcolor ) {

    LTDC->BCCR = bgcolor;
}


//////////////////////////// LAYER routines ////////////////////////////////////////////////////////

/*
 * @brief   LCD Set Default Color for layer
 */

void
LCD_SetDefaultColor(int layer,  uint32_t color ) {

    LTDC_Layer[layer]->DCCR = color;
}

/*
 * @brief   LCD Set format for layer
 */
void  LCD_SetFormat(int layer, int format) {

    LTDC_Layer[layer]->PFCR = format;
}


/*
 * @brief   LCD Set Color Key for layer
 */

void
LCD_SetColorKey(int layer,  uint32_t c ) {

    LTDC_Layer[layer]->CKCR = c;
}


/*
 * @brief   LCD Get Frame Buffer Address of a specified layer
 */
void *
LCD_GetFrameBufferAddress(int layer) {

   return (void *) LTDC_Layer[layer]->CFBAR;
}


/*
 * @brief   LCD Get Format used in layer
 */
int   LCD_GetFormat(int layer) {

    return LTDC_Layer[layer]->PFCR;
}

/*
 * @brief   LCD Get Pixel Size in bytes of the layer specified
 */
int   LCD_GetPixelSize(int layer) {

    return pixelsize[LCD_GetFormat(layer)];
}

/*
 * @brief   LCD Get Pixel Size in bytes of the layer specified
 *
 * @note    Uses the pitch information to calculate the demanded
 *          area size
 */
int   LCD_GetMinimalFullFrameBufferSize(int format) {
int ps = pixelsize[format];

    return display->pitch[ps]*display->height;

}

/*
 * @brief   LCD Set Frame Buffer for layer
 */

void
LCD_SetFullSizeFrameBuffer(int layer, void *area, int format) {
LTDC_Layer_TypeDef *p = LTDC_Layer[layer];
uint32_t ps,w,h;

    ps        = pixelsize[format];
    h         = display->height;
    w         = display->width;
    p->PFCR   = format;
    p->CFBAR  = (uint32_t) area;
    p->CFBLNR = display->height;
    p->CFBLR  = (display->pitch[ps]<<LTDC_LxCFBLR_CFBP_Pos)
               |((display->width*ps+3)<<LTDC_LxCFBLR_CFBLL_Pos);
    p->WHPCR  = ((HSW+HBP+w-1)<LTDC_LxWHPCR_WHSPPOS_Pos)
               |((0)<<LTDC_LxWHPCR_WHSTPOS_Pos);
    p->WVPCR  = ((VSW+VBP+h-1)<LTDC_LxWVPCR_WVSPPOS_Pos)
               |((0)<<LTDC_LxWVPCR_WVSTPOS_Pos);

    //////////////////////////////////////////////


    // Enable layer
    p->CR |= LTDC_LxCR_LEN;
}

/**
 * @brief Get Framebuffer height
 *
 * @note  Returns the number of lines
 */
int
LCD_GetHeight(int layer) {

    return (LTDC_Layer[layer]->CFBLNR&LTDC_LxCFBLNR_CFBLNBR_Msk)>>LTDC_LxCFBLNR_CFBLNBR_Pos;

}

/**
 * @brief Get Framebuffer width in pixels
 */
int
LCD_GetWidth(int layer) {
LTDC_Layer_TypeDef *p = LTDC_Layer[layer];
int w, format, ps;


    format = p->PFCR;
    ps = pixelsize[format];
    w = (p->CFBLR&LTDC_LxCFBLR_CFBLL_Msk)>>LTDC_LxCFBLR_CFBLL_Pos;
    w -= 3;
    w /= ps;

    return w;

}

/**
 * @brief Get Framebuffer pitch
 *
 * @note This is the distance in bytes
 */
int
LCD_GetPitch(int layer) {

    return (LTDC_Layer[layer]->CFBLR&LTDC_LxCFBLR_CFBP_Msk)>>LTDC_LxCFBLR_CFBP_Pos;

}


/**
 * @brief   Get Line Address
 *
 * @note    It uses the pitch information to calculate the start position
 *          of a line in buffer
 */
void *LCD_GetLineAddress(int layer, int line) {
LTDC_Layer_TypeDef *p = LTDC_Layer[layer];

    uint32_t base = p->CFBAR;
    uint32_t pitch = p->CFBLR>>LTDC_LxCFBLR_CFBP_Pos;

    return (void *) (base + line*pitch);
}

/**
 * @brief   fill1
 *
 * @note    fill a memory area with a 1 byte value
 *
 */
static void fill1( void *area, int n, unsigned c) {
uint8_t uc;
uint8_t *p;
uint32_t uv;
uint32_t *q;

    p = (uint8_t *) area;
    uc = c&0xFF;
    // align to a word address (last two bits are zero)
    while( (n>0) && ((((uintptr_t)p)&0x3)!=0) ) {
        *p++ = uc;
        n--;
    }
    // after that, can fill 4 bytes at one
    uv = (uc<<24)|(uc<<16)|(uc<<8)|uc;
    q = (uint32_t *) p;
    while( n > 3 ) {
        *q++ = uv;
        n -= 4;
    }
    p = (uint8_t *) q;
    while( n>0 ) {
        *p++ = uc;
        n--;
    }

}

/**
 * @brief   fill2
 *
 * @note    Fill a memory area with a 16-bit value
 *
 */
static void fill2( void *area, int n, unsigned c) {
uint8_t *p;
uint16_t uc;
uint32_t uv;
uint32_t *q;

    p = (uint8_t *) area;
    uc = c&0xFFFF;
    // align to a even address
    while( ((uintptr_t) p)&3 ) {
        *p++ = uc;
        n--;
        uc = (uc>>8)|(uc<<8);
    }
    // after that, can fill 4 bytes at one
    uv = (uc<<16)|uc;
    q = (uint32_t *) p;
    while( n > 3 ) {
        *q++ = uv;
        n -= 4;
    }
    // fill the remaining bytes
    p = (uint8_t *) q;
    while( n > 0 ) {
        *p++ = uc;
        n--;
        uc = (uc>>8)|(uc<<8);
    }
}


/**
 * @brief   fill3
 *
 * @note    Fill the frame buffer with a 3-byte value
 *
 * @note    Memory organization
 *            word  | Pixel
 *         ---------|-----------------
 *            +0    | B1 R0 G0 B0
 *            +1    | G2 B2 R1 G1
 *            +2    | R3 G3 B3 R2
 */
static void fill3( void *area, int n, unsigned c) {
uint32_t w1,w2,w3;
uint8_t *p;
uint32_t uc;
uint32_t *q;

    p = (uint8_t *) area;
    uc = c&0xFFFFFF;
    // align to a even address
    while( ((uintptr_t) p)&3 ) {
        *p++ = uc;
        n--;
        uc = ((uc>>8)|(uc<<16))&0xFFFFFF;
    }
    // after that, can fill 4 bytes at one
    q = (uint32_t *) p;
    // uc = 0ABC
    w1 = (uc<<8)|(uc>>16);      // ABCA
    w2 = (uc<<16)|(uc>>8);      // BCAB
    w3 = (uc<<24)|uc;           // CABC
    while( n > 11 ) {
        *q++ = w3;
        *q++ = w2;
        *q++ = w1;
        n -= 12;
    }
    // fill the remaining bytes
    p = (uint8_t *) q;
    while( n > 0 ) {
        *p++ = uc;
        n--;
        uc = ((uc>>8)|(uc<<16))&0xFFFFFF;
    }
}

