hans-jorg/stm32f746g/24-LCD/lcd.c
/*
 * @brief   fill4
 *
 * @note    Fill the frame buffer with a 4-byte value
 */

static void fill4( void *area, int n, unsigned c) {
uint8_t *p;
uint32_t uc;
uint32_t *q;

    p = (uint8_t *) area;
    uc = c;
    // align to a even address
    while( ((uintptr_t) p)&3 ) {
        *p++ = uc;
        n--;
        uc = (uc>>8)|(uc<<24);
    }
    // after that, can fill 4 bytes at one
    q = (uint32_t *) p;
    while( n > 3 ) {
        *q++ = uc;
        n -= 4;
    }
    // fill the remaining bytes
    p = (uint8_t *) q;
    while( n > 0 ) {
        *p++ = uc;
        n--;
        uc = (uc>>8)|(uc<<24);
    }

}


/*
 * @brief   LCD_FillFrameBuffer
 *
 * @note    Fill the frame buffer with a color using an efficient algorithm
 */
void
LCD_FillFrameBuffer(int layer, unsigned color ) {
LTDC_Layer_TypeDef *p = LTDC_Layer[layer];
int  ps;
char *area;
int  w,h,pitch;
int i;

    ps     = LCD_GetPixelSize(layer);
    area   = (char *) LCD_GetFrameBufferAddress(layer);
    w      = LCD_GetWidth(layer);
    h      = LCD_GetHeight(layer);
    pitch  = LCD_GetPitch(layer);

    switch(ps) {
    case 1:
        w = LCD_GetPitch(layer);
        fill1(area,w*h,color);
        break;
    case 2:
        for(i=0;i<h;i++) {
            area = (char *) LCD_GetLineAddress(layer,i);
            fill2(area,pitch,color);
        }
        break;
    case 3:
        for(i=0;i<h;i++) {
            area = (char *) LCD_GetLineAddress(layer,i);
            fill3(area,pitch,color);
        }
        break;
    case 4:
        for(i=0;i<h;i++) {
            area = (char *) LCD_GetLineAddress(layer,i);
            fill4(area,pitch,color);
        }
        break;
    default:
        break;
    }
}

